----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv3d-1    [-1, 64, 128, 128, 128]           1,728
            Conv3d-2    [-1, 64, 128, 128, 128]           1,728
    InstanceNorm3d-3    [-1, 64, 128, 128, 128]             128
    InstanceNorm3d-4    [-1, 64, 128, 128, 128]             128
         LeakyReLU-5    [-1, 64, 128, 128, 128]               0
         LeakyReLU-6    [-1, 64, 128, 128, 128]               0
            Conv3d-7    [-1, 64, 128, 128, 128]         110,592
            Conv3d-8    [-1, 64, 128, 128, 128]         110,592
    InstanceNorm3d-9    [-1, 64, 128, 128, 128]             128
   InstanceNorm3d-10    [-1, 64, 128, 128, 128]             128
        LeakyReLU-11    [-1, 64, 128, 128, 128]               0
        LeakyReLU-12    [-1, 64, 128, 128, 128]               0
   UnetBasicBlock-13    [-1, 64, 128, 128, 128]               0
   UnetBasicBlock-14    [-1, 64, 128, 128, 128]               0
           Conv3d-15       [-1, 96, 64, 64, 64]         165,888
           Conv3d-16       [-1, 96, 64, 64, 64]         165,888
   InstanceNorm3d-17       [-1, 96, 64, 64, 64]             192
   InstanceNorm3d-18       [-1, 96, 64, 64, 64]             192
        LeakyReLU-19       [-1, 96, 64, 64, 64]               0
        LeakyReLU-20       [-1, 96, 64, 64, 64]               0
           Conv3d-21       [-1, 96, 64, 64, 64]         248,832
           Conv3d-22       [-1, 96, 64, 64, 64]         248,832
   InstanceNorm3d-23       [-1, 96, 64, 64, 64]             192
   InstanceNorm3d-24       [-1, 96, 64, 64, 64]             192
        LeakyReLU-25       [-1, 96, 64, 64, 64]               0
        LeakyReLU-26       [-1, 96, 64, 64, 64]               0
   UnetBasicBlock-27       [-1, 96, 64, 64, 64]               0
   UnetBasicBlock-28       [-1, 96, 64, 64, 64]               0
           Conv3d-29      [-1, 128, 32, 32, 32]         331,776
           Conv3d-30      [-1, 128, 32, 32, 32]         331,776
   InstanceNorm3d-31      [-1, 128, 32, 32, 32]             256
   InstanceNorm3d-32      [-1, 128, 32, 32, 32]             256
        LeakyReLU-33      [-1, 128, 32, 32, 32]               0
        LeakyReLU-34      [-1, 128, 32, 32, 32]               0
           Conv3d-35      [-1, 128, 32, 32, 32]         442,368
           Conv3d-36      [-1, 128, 32, 32, 32]         442,368
   InstanceNorm3d-37      [-1, 128, 32, 32, 32]             256
   InstanceNorm3d-38      [-1, 128, 32, 32, 32]             256
        LeakyReLU-39      [-1, 128, 32, 32, 32]               0
        LeakyReLU-40      [-1, 128, 32, 32, 32]               0
   UnetBasicBlock-41      [-1, 128, 32, 32, 32]               0
   UnetBasicBlock-42      [-1, 128, 32, 32, 32]               0
           Conv3d-43      [-1, 192, 16, 16, 16]         663,552
           Conv3d-44      [-1, 192, 16, 16, 16]         663,552
   InstanceNorm3d-45      [-1, 192, 16, 16, 16]             384
   InstanceNorm3d-46      [-1, 192, 16, 16, 16]             384
        LeakyReLU-47      [-1, 192, 16, 16, 16]               0
        LeakyReLU-48      [-1, 192, 16, 16, 16]               0
           Conv3d-49      [-1, 192, 16, 16, 16]         995,328
           Conv3d-50      [-1, 192, 16, 16, 16]         995,328
   InstanceNorm3d-51      [-1, 192, 16, 16, 16]             384
   InstanceNorm3d-52      [-1, 192, 16, 16, 16]             384
        LeakyReLU-53      [-1, 192, 16, 16, 16]               0
        LeakyReLU-54      [-1, 192, 16, 16, 16]               0
   UnetBasicBlock-55      [-1, 192, 16, 16, 16]               0
   UnetBasicBlock-56      [-1, 192, 16, 16, 16]               0
           Conv3d-57         [-1, 256, 8, 8, 8]       1,327,104
           Conv3d-58         [-1, 256, 8, 8, 8]       1,327,104
   InstanceNorm3d-59         [-1, 256, 8, 8, 8]             512
   InstanceNorm3d-60         [-1, 256, 8, 8, 8]             512
        LeakyReLU-61         [-1, 256, 8, 8, 8]               0
        LeakyReLU-62         [-1, 256, 8, 8, 8]               0
           Conv3d-63         [-1, 256, 8, 8, 8]       1,769,472
           Conv3d-64         [-1, 256, 8, 8, 8]       1,769,472
   InstanceNorm3d-65         [-1, 256, 8, 8, 8]             512
   InstanceNorm3d-66         [-1, 256, 8, 8, 8]             512
        LeakyReLU-67         [-1, 256, 8, 8, 8]               0
        LeakyReLU-68         [-1, 256, 8, 8, 8]               0
   UnetBasicBlock-69         [-1, 256, 8, 8, 8]               0
   UnetBasicBlock-70         [-1, 256, 8, 8, 8]               0
           Conv3d-71         [-1, 384, 4, 4, 4]       2,654,208
           Conv3d-72         [-1, 384, 4, 4, 4]       2,654,208
   InstanceNorm3d-73         [-1, 384, 4, 4, 4]             768
   InstanceNorm3d-74         [-1, 384, 4, 4, 4]             768
        LeakyReLU-75         [-1, 384, 4, 4, 4]               0
        LeakyReLU-76         [-1, 384, 4, 4, 4]               0
           Conv3d-77         [-1, 384, 4, 4, 4]       3,981,312
           Conv3d-78         [-1, 384, 4, 4, 4]       3,981,312
   InstanceNorm3d-79         [-1, 384, 4, 4, 4]             768
   InstanceNorm3d-80         [-1, 384, 4, 4, 4]             768
        LeakyReLU-81         [-1, 384, 4, 4, 4]               0
        LeakyReLU-82         [-1, 384, 4, 4, 4]               0
   UnetBasicBlock-83         [-1, 384, 4, 4, 4]               0
   UnetBasicBlock-84         [-1, 384, 4, 4, 4]               0
  ConvTranspose3d-85         [-1, 256, 8, 8, 8]         786,432
  ConvTranspose3d-86         [-1, 256, 8, 8, 8]         786,432
           Conv3d-87         [-1, 256, 8, 8, 8]       3,538,944
           Conv3d-88         [-1, 256, 8, 8, 8]       3,538,944
   InstanceNorm3d-89         [-1, 256, 8, 8, 8]             512
   InstanceNorm3d-90         [-1, 256, 8, 8, 8]             512
        LeakyReLU-91         [-1, 256, 8, 8, 8]               0
        LeakyReLU-92         [-1, 256, 8, 8, 8]               0
           Conv3d-93         [-1, 256, 8, 8, 8]       1,769,472
           Conv3d-94         [-1, 256, 8, 8, 8]       1,769,472
   InstanceNorm3d-95         [-1, 256, 8, 8, 8]             512
   InstanceNorm3d-96         [-1, 256, 8, 8, 8]             512
        LeakyReLU-97         [-1, 256, 8, 8, 8]               0
        LeakyReLU-98         [-1, 256, 8, 8, 8]               0
   UnetBasicBlock-99         [-1, 256, 8, 8, 8]               0
  UnetBasicBlock-100         [-1, 256, 8, 8, 8]               0
     UnetUpBlock-101         [-1, 256, 8, 8, 8]               0
     UnetUpBlock-102         [-1, 256, 8, 8, 8]               0
DynUNetSkipLayer-103         [-1, 256, 8, 8, 8]               0
 ConvTranspose3d-104      [-1, 192, 16, 16, 16]         393,216
 ConvTranspose3d-105      [-1, 192, 16, 16, 16]         393,216
          Conv3d-106      [-1, 192, 16, 16, 16]       1,990,656
          Conv3d-107      [-1, 192, 16, 16, 16]       1,990,656
  InstanceNorm3d-108      [-1, 192, 16, 16, 16]             384
  InstanceNorm3d-109      [-1, 192, 16, 16, 16]             384
       LeakyReLU-110      [-1, 192, 16, 16, 16]               0
       LeakyReLU-111      [-1, 192, 16, 16, 16]               0
          Conv3d-112      [-1, 192, 16, 16, 16]         995,328
          Conv3d-113      [-1, 192, 16, 16, 16]         995,328
  InstanceNorm3d-114      [-1, 192, 16, 16, 16]             384
  InstanceNorm3d-115      [-1, 192, 16, 16, 16]             384
       LeakyReLU-116      [-1, 192, 16, 16, 16]               0
       LeakyReLU-117      [-1, 192, 16, 16, 16]               0
  UnetBasicBlock-118      [-1, 192, 16, 16, 16]               0
  UnetBasicBlock-119      [-1, 192, 16, 16, 16]               0
     UnetUpBlock-120      [-1, 192, 16, 16, 16]               0
     UnetUpBlock-121      [-1, 192, 16, 16, 16]               0
DynUNetSkipLayer-122      [-1, 192, 16, 16, 16]               0
 ConvTranspose3d-123      [-1, 128, 32, 32, 32]         196,608
 ConvTranspose3d-124      [-1, 128, 32, 32, 32]         196,608
          Conv3d-125      [-1, 128, 32, 32, 32]         884,736
          Conv3d-126      [-1, 128, 32, 32, 32]         884,736
  InstanceNorm3d-127      [-1, 128, 32, 32, 32]             256
  InstanceNorm3d-128      [-1, 128, 32, 32, 32]             256
       LeakyReLU-129      [-1, 128, 32, 32, 32]               0
       LeakyReLU-130      [-1, 128, 32, 32, 32]               0
          Conv3d-131      [-1, 128, 32, 32, 32]         442,368
          Conv3d-132      [-1, 128, 32, 32, 32]         442,368
  InstanceNorm3d-133      [-1, 128, 32, 32, 32]             256
  InstanceNorm3d-134      [-1, 128, 32, 32, 32]             256
       LeakyReLU-135      [-1, 128, 32, 32, 32]               0
       LeakyReLU-136      [-1, 128, 32, 32, 32]               0
  UnetBasicBlock-137      [-1, 128, 32, 32, 32]               0
  UnetBasicBlock-138      [-1, 128, 32, 32, 32]               0
     UnetUpBlock-139      [-1, 128, 32, 32, 32]               0
     UnetUpBlock-140      [-1, 128, 32, 32, 32]               0
DynUNetSkipLayer-141      [-1, 128, 32, 32, 32]               0
 ConvTranspose3d-142       [-1, 96, 64, 64, 64]          98,304
 ConvTranspose3d-143       [-1, 96, 64, 64, 64]          98,304
          Conv3d-144       [-1, 96, 64, 64, 64]         497,664
          Conv3d-145       [-1, 96, 64, 64, 64]         497,664
  InstanceNorm3d-146       [-1, 96, 64, 64, 64]             192
  InstanceNorm3d-147       [-1, 96, 64, 64, 64]             192
       LeakyReLU-148       [-1, 96, 64, 64, 64]               0
       LeakyReLU-149       [-1, 96, 64, 64, 64]               0
          Conv3d-150       [-1, 96, 64, 64, 64]         248,832
          Conv3d-151       [-1, 96, 64, 64, 64]         248,832
  InstanceNorm3d-152       [-1, 96, 64, 64, 64]             192
  InstanceNorm3d-153       [-1, 96, 64, 64, 64]             192
       LeakyReLU-154       [-1, 96, 64, 64, 64]               0
       LeakyReLU-155       [-1, 96, 64, 64, 64]               0
  UnetBasicBlock-156       [-1, 96, 64, 64, 64]               0
  UnetBasicBlock-157       [-1, 96, 64, 64, 64]               0
     UnetUpBlock-158       [-1, 96, 64, 64, 64]               0
     UnetUpBlock-159       [-1, 96, 64, 64, 64]               0
DynUNetSkipLayer-160       [-1, 96, 64, 64, 64]               0
 ConvTranspose3d-161    [-1, 64, 128, 128, 128]          49,152
 ConvTranspose3d-162    [-1, 64, 128, 128, 128]          49,152
          Conv3d-163    [-1, 64, 128, 128, 128]         221,184
          Conv3d-164    [-1, 64, 128, 128, 128]         221,184
  InstanceNorm3d-165    [-1, 64, 128, 128, 128]             128
  InstanceNorm3d-166    [-1, 64, 128, 128, 128]             128
       LeakyReLU-167    [-1, 64, 128, 128, 128]               0
       LeakyReLU-168    [-1, 64, 128, 128, 128]               0
          Conv3d-169    [-1, 64, 128, 128, 128]         110,592
          Conv3d-170    [-1, 64, 128, 128, 128]         110,592
  InstanceNorm3d-171    [-1, 64, 128, 128, 128]             128
  InstanceNorm3d-172    [-1, 64, 128, 128, 128]             128
       LeakyReLU-173    [-1, 64, 128, 128, 128]               0
       LeakyReLU-174    [-1, 64, 128, 128, 128]               0
  UnetBasicBlock-175    [-1, 64, 128, 128, 128]               0
  UnetBasicBlock-176    [-1, 64, 128, 128, 128]               0
     UnetUpBlock-177    [-1, 64, 128, 128, 128]               0
     UnetUpBlock-178    [-1, 64, 128, 128, 128]               0
DynUNetSkipLayer-179    [-1, 64, 128, 128, 128]               0
          Conv3d-180     [-1, 1, 128, 128, 128]              65
    UnetOutBlock-181     [-1, 1, 128, 128, 128]               0
================================================================
Total params: 49,846,209
Trainable params: 49,846,209
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 8.00
Forward/backward pass size (MB): 41449.62
Params size (MB): 190.15
Estimated Total Size (MB): 41647.77
----------------------------------------------------------------

